app/controllers/hamburguesa_ingredientes_controller.rb

  def addingredient
    # Reviso si la hamburguesa existe
    if Hamburguesa.exists?(params[:hid])
      @hamburguesa = Hamburguesa.find(params[:hid])
    else
      render :status => 400, json: {message: "Id de hamburguesa invalido"}
      return
    end
    # Reviso si el ingrediente existe
    if Ingrediente.exists?(params[:iid])
      @ingrediente = Ingrediente.find(params[:iid])
    else
      render :status => 404, json: {message: "Ingrediente inexistente"}
      return
    end

    # Cargo todos los ingredientes de la hamburguesa
    @ingredientes_hamburguesa = HamburguesaIngrediente.where(hamburguesa_id: params[:hid])
    # Reviso si el ingrediente ya está
    @ingredientes_hamburguesa.each do |ingrediente|
      if ingrediente.ingrediente_id.to_i == params[:iid].to_i
        render :status => 400, json: {message: "Ingrediente ya está en la hamburguesa"}
        return
      end
    end
    # Creo la entrada en la tabla intermedia
    @hamburguesa_ingrediente = HamburguesaIngrediente.new
    @hamburguesa_ingrediente.hamburguesa_id = params[:hid]
    @hamburguesa_ingrediente.ingrediente_id = params[:iid]
    @hamburguesa_ingrediente.save

    # Agrego el ingrediente a la lista de ingredientes de la hamburguesa
    hash = {path: $global_url + "/ingrediente/" + params[:iid]}
    @hamburguesa.ingredientes.push(hash)
    @hamburguesa.update_attribute("ingredientes", @hamburguesa.ingredientes)
---
SELECT  "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "hamburguesa_ingredientes".* FROM "hamburguesa_ingredientes" WHERE "hamburguesa_ingredientes"."hamburguesa_id" = $1 LIMIT $2  [["hamburguesa_id", 1], ["LIMIT", 1]]
SELECT "hamburguesa_ingredientes".* FROM "hamburguesa_ingredientes" WHERE "hamburguesa_ingredientes"."hamburguesa_id" = $1  [["hamburguesa_id", 1]]
INSERT INTO "hamburguesa_ingredientes" ("hamburguesa_id", "ingrediente_id") VALUES ($1, $2) RETURNING "id"  [["hamburguesa_id", 1], ["ingrediente_id", 1]]
UPDATE "hamburguesas" SET "ingredientes" = $1 WHERE "hamburguesas"."id" = $2  [["ingredientes", "{\"{:path=>\\\"https://localhost:3000/ingrediente/1\\\"}\"}"], ["id", 1]]
UPDATE "hamburguesas" SET "ingredientes" = $1 WHERE "hamburguesas"."id" = $2

  def deleteingredient
    # Reviso si la hamburguesa existe
    if Hamburguesa.exists?(params[:hid])
      @hamburguesa = Hamburguesa.find(params[:hid])
    else
      render :status => 400, json: {message: "Id de hamburguesa invalido"}
      return
    end

    # Reviso si el ingrediente existe
    if Ingrediente.exists?(params[:iid])
      @ingrediente = Ingrediente.find(params[:iid])
    else
      render :status => 404, json: {message: "Ingrediente inexistente"}
      return
    end

    # Reviso si el ingrediente está en la hamburguesa
    @ingredientes_hamburguesa = HamburguesaIngrediente.where(hamburguesa_id: params[:hid])
    if @ingredientes_hamburguesa.where(ingrediente_id: params[:iid]).length == 0
        render :status => 404, json: {message: "Ingrediente inexistente en la hamburguesa"}
        return
    end
    # Quito el ingrediente de la hamburguesa en la tabla intermedia
    @ingredientes_hamburguesa.where(ingrediente_id: params[:iid])[0].destroy
    # Quito el ingrediente del modelo de la hamburguesa
    @hamburguesa.ingredientes.each do |ingrediente|
      if ingrediente["path"].split("/")[-1] == params[:iid]
        @hamburguesa.ingredientes.delete(ingrediente)
        @hamburguesa.update_attribute("ingredientes", @hamburguesa.ingredientes)
---
SELECT  "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "hamburguesa_ingredientes".* FROM "hamburguesa_ingredientes" WHERE "hamburguesa_ingredientes"."hamburguesa_id" = $1  [["hamburguesa_id", 1]]
SELECT "hamburguesa_ingredientes".* FROM "hamburguesa_ingredientes" WHERE "hamburguesa_ingredientes"."hamburguesa_id" = $1 AND "hamburguesa_ingredientes"."ingrediente_id" = $2  [["hamburguesa_id", 1], ["ingrediente_id", 1]]
DELETE FROM "hamburguesa_ingredientes" WHERE "hamburguesa_ingredientes"."id" = $1  [["id", 3]]
SELECT "hamburguesa_ingredientes".* FROM "hamburguesa_ingredientes" WHERE "hamburguesa_ingredientes"."hamburguesa_id" = $1 AND "hamburguesa_ingredientes"."ingrediente_id" = $2  [["hamburguesa_id", 1], ["ingrediente_id", 2]]
UPDATE "hamburguesas" SET "ingredientes" = $1 WHERE "hamburguesas"."id" = $2  [["ingredientes", "[{\"path\":\"http://localhost:3000/ingrediente/1\"}]"], ["id", 1]]