app/controllers/hamburguesas_controller.rb

    def set_hamburguesa
      if params[:id].to_i == 0
        render :status => 400, json: {message: "Id invalido"}
        return
      end
      @hamburguesa = Hamburguesa.find_by(id: params[:id])
---
SELECT  "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]