app/controllers/hamburguesas_controller.rb

  def index
    @hamburguesas = Hamburguesa.all
---
SELECT "hamburguesas".* FROM "hamburguesas"

  def create # chequear input invalido
    @hamburguesa = Hamburguesa.new(hamburguesa_params)
    if @hamburguesa.save
---
INSERT INTO "hamburguesas" ("nombre", "precio", "imagen") VALUES ($1, $2, $3) RETURNING "id"  [["nombre", "Doble Cuarto de Libra"], ["precio", 4990], ["imagen", "https://cdn.mcdonalds.es/sites/default/files/produits/cuarto-de-libra-con-queso_1_0.png"]]

  def update
    if params[:nombre] == nil || params[:descripcion] == nil || params[:precio] == nil || params[:imagen] == nil
      render :status => 400, json: {message: "Input invalido"}
      return
    end
    if @hamburguesa.update(hamburguesa_params)
---
UPDATE "hamburguesas" SET "precio" = $1 WHERE "hamburguesas"."id" = $2  [["precio", 6990], ["id", 1]]

  def destroy
    if @hamburguesa == nil
      render :status => 404, json: {message: "Hamburguesa inexistente"}
      return
    end
    @hamburguesa.destroy
---
DELETE FROM "hamburguesas" WHERE "hamburguesas"."id" = $1  [["id", 1]]

    def set_hamburguesa
      if params[:id].to_i == 0
        render :status => 400, json: {message: "Id invalido"}
        return
      end
      @hamburguesa = Hamburguesa.find_by(id: params[:id])
---
SELECT  "hamburguesas".* FROM "hamburguesas" WHERE "hamburguesas"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]