app/controllers/ingredientes_controller.rb

  def index
    @ingredientes = Ingrediente.all
---
SELECT "ingredientes".* FROM "ingredientes"

  def create
    if params[:nombre] == nil || params[:descripcion] == nil
      render :status => 400, json: {message: "Input invalido"}
      return
    end
    @ingrediente = Ingrediente.new(ingrediente_params)
    if @ingrediente.save
---
INSERT INTO "ingredientes" ("nombre", "descripcion") VALUES ($1, $2) RETURNING "id"  [["nombre", "Pepinillos"], ["descripcion", "Frescos, directamente de la granja"]]

  def destroy
    if HamburguesaIngrediente.where(ingrediente_id: params[:id]).length != 0
      render :status => 409, json: {message: "Ingrediente no se puede borrar, se encuentra presente en una hamburguesa"}
      return
    end
    @ingrediente.destroy
---
SELECT "hamburguesa_ingredientes".* FROM "hamburguesa_ingredientes" WHERE "hamburguesa_ingredientes"."ingrediente_id" = $1  [["ingrediente_id", 2]]
DELETE FROM "ingredientes" WHERE "ingredientes"."id" = $1  [["id", 2]]

    def set_ingrediente
      if params[:id].to_i == 0
        render :status => 400, json: {message: "Id invalido"}
        return
      end
      if Ingrediente.exists?(params[:id])
        @ingrediente = Ingrediente.find(params[:id])
---
SELECT  "ingredientes".* FROM "ingredientes" WHERE "ingredientes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]